{
  "design-thinking": {
    "title": "Design Thinking for Educators",
    "category": "development",
    "featured": true,
    "description": "Master the design thinking process to create innovative solutions for classroom challenges and student-centered learning experiences.",
    "duration": "2 days (16 hours)",
    "mode": ["In-person workshop", "Live virtual training"],
    "outcomes": [
      "Apply design thinking methodology to solve educational challenges",
      "Create user-centered learning experiences for students",
      "Implement prototyping and testing techniques in classroom projects",
      "Foster a culture of innovation and creative problem-solving"
    ],
    "whyTake": "Design thinking transforms how you approach problems in education. This methodology helps you create solutions that truly address student needs and improves learning outcomes through iterative testing and refinement.",
    "fee": "₹15,000 per participant",
    "institutionalDiscount": "Yes, 15% discount for groups of 5 or more from the same institution",
    "image": "https://images.unsplash.com/photo-1454165804606-c3d57bc86b40?auto=format&fit=crop&q=80&w=1740",
    "icon":"Brain"
  },
  "engaging-classrooms": {
    "title": "Creating Engaging Classrooms",
    "category": "development",
    "description": "Transform your classroom with modern technology integration and engagement techniques that capture student attention and improve learning outcomes.",
    "duration": "3 days (24 hours)",
    "mode": ["In-person workshop", "Live virtual training", "Self-paced online course"],
    "outcomes": [
      "Design interactive lesson plans using digital tools",
      "Implement gamification strategies to increase student engagement",
      "Create multimedia learning materials that appeal to diverse learning styles",
      "Measure and analyze student engagement with assessment tools"
    ],
    "whyTake": "In the digital age, traditional teaching methods often fail to capture student attention. This program equips you with proven strategies to create classroom experiences that excite and motivate students while enhancing learning outcomes.",
    "fee": "₹18,000 per participant",
    "institutionalDiscount": "Yes, 20% discount for groups of 8 or more from the same institution",
    "image": "https://images.unsplash.com/photo-1522202176988-66273c2fd55f?auto=format&fit=crop&q=80&w=1742",
    "icon":"Classroom"
  },
  "ai-teaching": {
    "title": "Teaching Strategies with AI",
    "category": "development",
    "description": "Learn how to leverage AI tools to enhance learning outcomes, streamline administrative tasks, and prepare students for an AI-powered future.",
    "duration": "2 days (16 hours)",
    "mode": ["Live virtual training", "Self-paced online course with mentorship"],
    "outcomes": [
      "Integrate AI tools into your teaching practice ethically and effectively",
      "Create personalized learning experiences using AI-driven analytics",
      "Automate routine tasks to focus more on teaching and student interaction",
      "Prepare students with AI literacy skills for future careers"
    ],
    "whyTake": "AI is transforming education at an unprecedented pace. This program provides practical knowledge on how to harness AI tools to enhance your teaching while maintaining the human connection that makes great education possible.",
    "fee": "₹16,500 per participant",
    "institutionalDiscount": "Yes, 15% discount for groups of 6 or more from the same institution",
    "image": "https://images.unsplash.com/photo-1600456899121-68eda5705257?auto=format&fit=crop&q=80&w=1740"
  },
    "digital-literacy": {
        "title": "Digital Literacy for Educators",
        "category": "innovation",
        "description": "Empower educators with essential digital skills to navigate technology in the classroom and enhance student learning.",
        "duration": "2 days (16 hours)",
        "mode": ["In-person workshop", "Live virtual training"],
        "outcomes": [
            "Develop a strong foundation in digital literacy concepts",
            "Utilize various digital tools and platforms for teaching and learning",
            "Create and manage online learning environments effectively",
            "Implement best practices for online communication and collaboration"
        ],
        "whyTake": "Digital literacy is crucial for modern educators. This program equips you with the skills needed to effectively integrate technology into your teaching, enhancing both your professional development and student learning experiences.",
        "fee": "₹14,000 per participant",
        "institutionalDiscount": "Yes, 15% discount for groups of 5 or more from the same institution",
        "image": "https://images.unsplash.com/photo-1519389950473-47ba0277781c?auto=format&fit=crop&q=80&w=1740"
        },
    "innovation-ambassador": {
      "title": "School Innovation Ambassador",
      "category": "innovation",
      "featured": true,
      "description": "Get guided preparation for the MoEd Government of India's School Innovation Ambassador program with mentorship and practical exercises.",
      "duration": "5 days (40 hours)",
      "mode": ["Blended learning (3 days in-person + 2 days virtual)"],
      "outcomes": [
        "Master the curriculum requirements for the School Innovation Ambassador program",
        "Develop leadership skills to drive innovation in educational institutions",
        "Create and implement innovation policies for schools",
        "Design sustainable innovation ecosystems within educational environments"
      ],
      "whyTake": "The Government of India's School Innovation Ambassador program is a prestigious certification that positions you as an innovation leader in education. Our preparation program significantly increases your chances of success and provides networking opportunities with like-minded educators.",
      "fee": "₹25,000 per participant",
      "institutionalDiscount": "Yes, 25% discount for groups of 4 or more from the same institution",
      "image": "https://images.unsplash.com/photo-1531482615713-2afd69097998?auto=format&fit=crop&q=80&w=1740"
    },
    "google-certified": {
      "title": "Google Certified Educator",
      "category": "certification",
      "description": "Comprehensive preparation for Google's Level 1 and Level 2 Educator certifications, including hands-on practice with Google Workspace tools.",
      "duration": "4 days (32 hours)",
      "mode": ["Live virtual training", "Self-paced online course with live support"],
      "outcomes": [
        "Master all competencies required for Google Level 1 and Level 2 certifications",
        "Implement Google Workspace tools effectively in educational contexts",
        "Create collaborative learning environments using Google's ecosystem",
        "Design and share innovative Google-based lesson plans and activities"
      ],
      "whyTake": "Google Certified Educator credentials are internationally recognized and demonstrate your proficiency with digital tools that are increasingly standard in modern education. Our program has a 95% pass rate for participants who complete all modules.",
      "fee": "₹20,000 per participant",
      "institutionalDiscount": "Yes, 20% discount for groups of 5 or more from the same institution",
      "image": "https://images.unsplash.com/photo-1548092372-0d1bd40894a3?auto=format&fit=crop&q=80&w=1740"
    },
    "microsoft-educator": {
      "title": "Microsoft Educator",
      "category": "certification",
      "description": "Expert training to help you become a Microsoft Certified Educator and leverage Microsoft tools to enhance teaching and learning.",
      "duration": "4 days (32 hours)",
      "mode": ["In-person workshop", "Live virtual training"],
      "outcomes": [
        "Achieve Microsoft Certified Educator status with confidence",
        "Implement Microsoft 365 tools effectively in educational settings",
        "Create inclusive classroom experiences using Microsoft accessibility features",
        "Develop advanced skills in Teams, OneNote, and other Microsoft educational tools"
      ],
      "whyTake": "Microsoft tools are among the most widely used in educational institutions worldwide. This certification demonstrates your ability to leverage these tools to create modern, collaborative learning environments that prepare students for the workplace.",
      "fee": "₹4,500 per participant",
      "institutionalDiscount": "Yes, 18% discount for groups of 6 or more from the same institution",
      "image": "https://images.unsplash.com/photo-1519389950473-47ba0277781c?auto=format&fit=crop&q=80&w=1740"
    },
    "apple-teacher": {
      "title": "Apple Teacher Program",
      "category": "certification",
      "description": "Specialized training to help educators integrate Apple technology in the classroom and achieve Apple Teacher recognition.",
      "duration": "3 days (24 hours)",
      "mode": ["In-person workshop", "Live virtual training"],
      "outcomes": [
        "Master core competencies required for Apple Teacher recognition",
        "Create engaging learning materials using iPad, Mac, and Apple apps",
        "Implement Apple's Everyone Can Create and Everyone Can Code curricula",
        "Design inclusive learning experiences using Apple's accessibility features"
      ],
      "whyTake": "Apple's ecosystem offers powerful tools for creativity and innovation in education. This program helps you leverage these tools to their full potential while earning recognition as an Apple Teacher.",
      "fee": "₹21,000 per participant",
      "institutionalDiscount": "Yes, 15% discount for groups of 5 or more from the same institution",
      "image": "https://images.unsplash.com/photo-1517694712202-14dd9538aa97?auto=format&fit=crop&q=80&w=1740"
    },
    "adobe-creative": {
      "title": "Adobe Creative Educator",
      "description": "Learn to integrate digital creativity into your teaching with Adobe's educational tools and become an Adobe Creative Educator.",
      "duration": "3 days (24 hours)",
      "mode": ["Live virtual training", "Self-paced online course with mentorship"],
      "outcomes": [
        "Achieve Adobe Creative Educator Level 1 and Level 2 status",
        "Create compelling visual learning materials using Adobe Express and Creative Cloud",
        "Implement digital media projects that develop students' creative skills",
        "Design assessment strategies for creative digital work"
      ],
      "whyTake": "Digital creativity is an essential skill for future careers. The Adobe Creative Educator program helps you foster these skills in your students while developing your own creative teaching practice.",
      "fee": "₹18,500 per participant",
      "institutionalDiscount": "Yes, 15% discount for groups of 6 or more from the same institution",
      "image": "https://images.unsplash.com/photo-1574027632969-83a09c87f50c?auto=format&fit=crop&q=80&w=1740"
    },
    "digital-citizenship": {
      "title": "Digital Citizenship and Cyber Safety",
      "description": "Equipping teachers to model and teach responsible and safe online behavior, from digital footprints to cyberbullying response.",
      "duration": "2 days (16 hours)",
      "mode": ["In-person workshop", "Live virtual training", "Self-paced online course"],
      "outcomes": [
        "Teach students about managing digital footprints and online reputation",
        "Identify and effectively respond to cyberbullying situations",
        "Implement online safety and security best practices in educational settings",
        "Develop critical evaluation skills for identifying fake news and misinformation",
        "Create integrated digital citizenship curriculum across subjects"
      ],
      "whyTake": "As students spend more time online, educators must equip them with skills to navigate digital spaces responsibly and safely. This program provides practical strategies to help students become ethical, informed digital citizens while protecting them from online risks.",
      "fee": "₹16,000 per participant",
      "institutionalDiscount": "Yes, 15% discount for groups of 5 or more from the same institution",
      "image": "https://images.unsplash.com/photo-1563206767-5b18f218e8de?auto=format&fit=crop&q=80&w=1740"
    },
    "social-emotional": {
      "title": "Social-Emotional Learning and Technology",
      "description": "Integrating social-emotional learning (SEL) into the curriculum using technology tools to support student well-being and emotional intelligence.",
      "duration": "2 days (16 hours)",
      "mode": ["In-person workshop", "Live virtual training"],
      "outcomes": [
        "Implement SEL frameworks in your teaching practice",
        "Utilize technology tools to support SEL activities and assessments",
        "Create a positive classroom culture that fosters emotional well-being",
        "Design engaging SEL lessons that integrate technology effectively"
      ],
      "whyTake": "Social-emotional learning is critical for student success, both academically and personally. This program equips you with practical strategies to integrate SEL into your teaching, enhancing student well-being and creating a supportive classroom environment.",
      "fee": "₹15,500 per participant",
      "institutionalDiscount": "Yes, 15% discount for groups of 6 or more from the same institution",
      "image": "https://images.unsplash.com/photo-1581291518633-83b4ebd1d83e?auto=format&fit=crop&q=80&w=1740"
    },
    "inclusive-education": {
      "title": "Inclusive Education and Technology",
      "description": "Using technology to cater to diverse learning needs and create equitable learning environments through assistive technologies and UDL principles.",
      "duration": "3 days (24 hours)",
      "mode": ["In-person workshop", "Live virtual training"],
      "outcomes": [
        "Implement various assistive technologies to support students with disabilities",
        "Utilize built-in accessibility features across different operating systems and platforms",
        "Apply Universal Design for Learning principles using technology tools",
        "Create differentiated instruction paths using digital tools",
        "Support specific learning needs with targeted technology solutions"
      ],
      "whyTake": "Every student deserves equal access to education. This program provides practical tools and strategies to create inclusive learning environments where all students can succeed, regardless of their learning differences or disabilities.",
      "fee": "₹18,000 per participant",
      "institutionalDiscount": "Yes, 20% discount for groups of 6 or more from the same institution",
      "image": "https://images.unsplash.com/photo-1509062522246-3755977927d7?auto=format&fit=crop&q=80&w=1764"
    },
    "edtech-tools": {
      "title": "EdTech Tools for Educators",
      "description": "Exploring a variety of educational technology tools to enhance teaching and learning experiences, from productivity to creativity.",
      "duration": "2 days (16 hours)",
      "mode": ["In-person workshop", "Live virtual training"],
      "outcomes": [
        "Identify and evaluate various EdTech tools for classroom use",
        "Implement productivity tools to streamline lesson planning and grading",
        "Create engaging multimedia content using digital creation tools",
        "Utilize collaboration platforms to enhance student interaction",
        "Integrate assessment tools for real-time feedback and data analysis"
      ],
      "whyTake": "The right EdTech tools can significantly enhance your teaching practice. This program provides hands-on experience with a range of tools that can improve productivity, creativity, and student engagement in the classroom.",
      "fee": "₹14,500 per participant",
      "institutionalDiscount": "Yes, 15% discount for groups of 5 or more from the same institution",
      "image": "https://images.unsplash.com/photo-1519389950473-47ba0277781c?auto=format&fit=crop&q=80&w=1740"
    },
    "digital-storytelling": {
      "title": "Digital Storytelling in Education",
      "description": "Harnessing the power of storytelling to create engaging digital narratives that enhance learning and foster creativity.",
      "duration": "2 days (16 hours)",
      "mode": ["In-person workshop", "Live virtual training"],
      "outcomes": [
        "Create compelling digital stories using various multimedia tools",
        "Implement storytelling techniques to enhance student engagement",
        "Design project-based learning activities centered around digital storytelling",
        "Evaluate and provide feedback on digital storytelling projects"
      ],
      "whyTake": "Storytelling is a powerful tool for learning. This program equips you with the skills to create engaging digital narratives that captivate students and enhance their understanding of complex concepts.",
      "fee": "₹15,000 per participant",
      "institutionalDiscount": "Yes, 15% discount for groups of 5 or more from the same institution",
      "image": "https://images.unsplash.com/photo-1506748686214-e9df14d4d9d0?auto=format&fit=crop&q=80&w=1740"
    },
    "virtual-reality": {
      "title": "Virtual Reality in Education",
      "description": "Exploring the potential of virtual reality (VR) to create immersive learning experiences that enhance student engagement and understanding.",
      "duration": "3 days (24 hours)",
      "mode": ["In-person workshop", "Live virtual training"],
      "outcomes": [
        "Implement VR tools and platforms in educational settings",
        "Design immersive learning experiences using VR technology",
        "Evaluate the effectiveness of VR in enhancing student learning outcomes",
        "Create engaging VR content for various subjects and grade levels"
      ],
      "whyTake": "Virtual reality is revolutionizing education by providing immersive experiences that enhance learning. This program equips you with the skills to integrate VR into your teaching practice, creating engaging and impactful learning environments.",
      "fee": "₹22,000 per participant",
      "institutionalDiscount": "Yes, 20% discount for groups of 5 or more from the same institution",
      "image": "https://images.unsplash.com/photo-1506748686214-e9df14d4d9d0?auto=format&fit=crop&q=80&w=1740"
    },
    "mobile-learning": {
      "title": "Mobile Learning Strategies",
      "description": "Leveraging mobile technology to create flexible, personalized learning experiences that extend beyond the classroom.",
      "duration": "2 days (16 hours)",
      "mode": ["In-person workshop", "Live virtual training"],
      "outcomes": [
        "Design mobile-friendly learning materials and activities",
        "Implement mobile apps and platforms for student engagement",
        "Create blended learning experiences using mobile technology",
        "Evaluate the effectiveness of mobile learning in your context"
      ],
      "whyTake": "Mobile technology is ubiquitous among students. This program provides practical strategies to leverage mobile devices for personalized, engaging learning experiences that extend beyond traditional classroom boundaries.",
      "fee": "₹14,000 per participant",
      "institutionalDiscount": "Yes, 15% discount for groups of 5 or more from the same institution",
      "image": "https://images.unsplash.com/photo-1519389950473-47ba0277781c?auto=format&fit=crop&q=80&w=1740"
    },
    "social-media": {
      "title": "Social Media in Education",
      "description": "Using social media platforms to enhance communication, collaboration, and engagement in educational settings.",
      "duration": "2 days (16 hours)",
      "mode": ["In-person workshop", "Live virtual training"],
      "outcomes": [
        "Implement social media strategies for classroom communication",
        "Create engaging content for various social media platforms",
        "Evaluate the effectiveness of social media in enhancing student engagement",
        "Design social media policies and guidelines for educational institutions"
      ],
      "whyTake": "Social media is a powerful tool for communication and collaboration. This program equips you with the skills to leverage social media effectively in your teaching practice, enhancing student engagement and learning outcomes.",
      "fee": "₹15,500 per participant",
      "institutionalDiscount": "Yes, 15% discount for groups of 6 or more from the same institution",
      "image": "https://images.unsplash.com/photo-1519389950473-47ba0277781c?auto=format&fit=crop&q=80&w=1740"
    },
    "online-safety": {
      "title": "Online Safety and Cybersecurity",
      "description": "Equipping educators with the knowledge and skills to ensure online safety for themselves and their students in a digital world.",
      "duration": "2 days (16 hours)",
      "mode": ["In-person workshop", "Live virtual training"],
      "outcomes": [
        "Identify common online threats and risks in educational settings",
        "Implement best practices for online safety and cybersecurity",
        "Create a culture of digital responsibility among students",
        "Develop policies and guidelines for online safety in schools"
      ],
      "whyTake": "As technology becomes more integrated into education, ensuring online safety is paramount. This program provides practical strategies to protect yourself and your students from online threats while fostering a culture of digital responsibility.",
      "fee": "₹14,500 per participant",
      "institutionalDiscount": "Yes, 15% discount for groups of 5 or more from the same institution",
      "image": "https://images.unsplash.com/photo-1519389950473-47ba0277781c?auto=format&fit=crop&q=80&w=1740"
    },
    "project-based": {
      "title": "Project-Based Learning with Technology",
      "description": "Implementing project-based learning (PBL) strategies using technology to enhance student engagement and real-world problem-solving.",
      "duration": "3 days (24 hours)",
      "mode": ["In-person workshop", "Live virtual training"],
      "outcomes": [
        "Design and implement project-based learning experiences using technology",
        "Facilitate student collaboration and communication in PBL environments",
        "Evaluate and assess student projects effectively",
        "Integrate technology tools to enhance PBL outcomes"
      ],
      "whyTake": "Project-based learning fosters critical thinking, collaboration, and real-world problem-solving skills. This program equips you with the tools to implement PBL effectively in your classroom, enhancing student engagement and learning outcomes.",
      "fee": "₹18,500 per participant",
      "institutionalDiscount": "Yes, 15% discount for groups of 6 or more from the same institution",
      "image": "https://images.unsplash.com/photo-1506748686214-e9df14d4d9d0?auto=format&fit=crop&q=80&w=1740"
    },
    "flipped-classroom": {
      "title": "Flipped Classroom Strategies",
      "description": "Transforming traditional teaching methods by flipping the classroom to enhance student engagement and learning outcomes.",
      "duration": "2 days (16 hours)",
      "mode": ["In-person workshop", "Live virtual training"],
      "outcomes": [
        "Design effective flipped classroom models for various subjects",
        "Create engaging pre-class and in-class activities using technology",
        "Implement assessment strategies to measure student learning in flipped environments",
        "Foster a culture of active learning and collaboration in the classroom"
      ],
      "whyTake": "Flipped classrooms can significantly enhance student engagement and learning outcomes. This program provides practical strategies to implement this innovative approach effectively, transforming your teaching practice.",
      "fee": "₹15,000 per participant",
      "institutionalDiscount": "Yes, 15% discount for groups of 5 or more from the same institution",
      "image": "https://images.unsplash.com/photo-1506748686214-e9df14d4d9d0?auto=format&fit=crop&q=80&w=1740"
    },
    "personalized-learning": {
      "title": "Personalized Learning with Technology",
      "description": "Creating personalized learning experiences using technology to meet the diverse needs of students and enhance engagement.",
      "duration": "3 days (24 hours)",
      "mode": ["In-person workshop", "Live virtual training"],
      "outcomes": [
        "Design personalized learning pathways for students using technology",
        "Implement adaptive learning tools to support individual student needs",
        "Create engaging, differentiated content for diverse learners",
        "Evaluate and assess personalized learning outcomes effectively"
      ],
      "whyTake": "Personalized learning is essential for meeting the diverse needs of students. This program equips you with the skills to create tailored learning experiences that enhance engagement and improve learning outcomes.",
      "fee": "₹17,500 per participant",
      "institutionalDiscount": "Yes, 15% discount for groups of 5 or more from the same institution",
      "image": "https://images.unsplash.com/photo-1506748686214-e9df14d4d9d0?auto=format&fit=crop&q=80&w=1740"
    },
    "digital-collaboration": {
      "title": "Digital Collaboration in Education",
      "description": "Fostering collaboration among students and educators using digital tools to enhance communication, teamwork, and engagement.",
      "duration": "2 days (16 hours)",
      "mode": ["In-person workshop", "Live virtual training"],
      "outcomes": [
        "Implement digital collaboration tools effectively in the classroom",
        "Design collaborative learning activities that enhance student engagement",
        "Evaluate and assess student collaboration skills using technology",
        "Create a culture of collaboration and teamwork among students"
      ],
      "whyTake": "Collaboration is a key skill for success in the 21st century. This program provides practical strategies to foster collaboration among students and educators using digital tools, enhancing communication and teamwork.",
      "fee": "₹14,500 per participant",
      "institutionalDiscount": "Yes, 15% discount for groups of 5 or more from the same institution",
      "image": "https://images.unsplash.com/photo-1506748686214-e9df14d4d9d0?auto=format&fit=crop&q=80&w=1740"
    },
    "digital-assessment": {
      "title": "Digital Assessment Strategies",
      "description": "Implementing effective digital assessment strategies to enhance student learning and provide timely feedback.",
      "duration": "2 days (16 hours)",
      "mode": ["In-person workshop", "Live virtual training"],
      "outcomes": [
        "Design and implement digital assessments that align with learning objectives",
        "Utilize technology tools for formative and summative assessment",
        "Provide timely, actionable feedback to students using digital platforms",
        "Analyze assessment data to inform instructional decisions"
      ],
      "whyTake": "Effective assessment is crucial for student success. This program provides practical strategies to implement digital assessment techniques that enhance learning and provide timely feedback.",
      "fee": "₹15,000 per participant",
      "institutionalDiscount": "Yes, 15% discount for groups of 5 or more from the same institution",
      "image": "https://images.unsplash.com/photo-1506748686214-e9df14d4d9d0?auto=format&fit=crop&q=80&w=1740"
    },
    "digital-curriculum": {
      "title": "Digital Curriculum Design",
      "description": "Creating engaging, technology-enhanced curriculum materials that align with learning objectives and student needs.",
      "duration": "3 days (24 hours)",
      "mode": ["In-person workshop", "Live virtual training"],
      "outcomes": [
        "Design technology-enhanced curriculum materials that engage students",
        "Implement best practices for digital curriculum design and development",
        "Evaluate and assess digital curriculum effectiveness using data",
        "Create inclusive, accessible curriculum materials for diverse learners"
      ],
      "whyTake": "Effective curriculum design is essential for student success. This program provides practical strategies to create engaging, technology-enhanced curriculum materials that meet the needs of all learners.",
      "fee": "₹18,000 per participant",
      "institutionalDiscount": "Yes, 15% discount for groups of 5 or more from the same institution",
      "image": "https://images.unsplash.com/photo-1506748686214-e9df14d4d9d0?auto=format&fit=crop&q=80&w=1740"
    },
    "digital-pedagogy": {
      "title": "Digital Pedagogy for Educators",
      "description": "Exploring innovative digital pedagogy strategies to enhance teaching and learning experiences in the classroom.",
      "duration": "2 days (16 hours)",
      "mode": ["In-person workshop", "Live virtual training"],
      "outcomes": [
        "Implement digital pedagogy strategies to enhance student engagement",
        "Design technology-enhanced lesson plans that align with learning objectives",
        "Evaluate and assess digital pedagogy effectiveness using data",
        "Create inclusive, accessible learning environments using technology"
      ],
      "whyTake": "Digital pedagogy is essential for modern educators. This program provides practical strategies to enhance teaching and learning experiences using technology, improving student engagement and outcomes.",
      "fee": "₹15,500 per participant",
      "institutionalDiscount": "Yes, 15% discount for groups of 5 or more from the same institution",
      "image": "https://images.unsplash.com/photo-1506748686214-e9df14d4d9d0?auto=format&fit=crop&q=80&w=1740"
    },
    "digital-communication": {
      "title": "Digital Communication Skills for Educators",
      "description": "Enhancing communication skills using digital tools to improve collaboration and engagement in educational settings.",
      "duration": "2 days (16 hours)",
      "mode": ["In-person workshop", "Live virtual training"],
      "outcomes": [
        "Implement effective digital communication strategies in the classroom",
        "Utilize various digital tools for collaboration and engagement",
        "Create engaging content for online communication platforms",
        "Evaluate and assess digital communication effectiveness using data"
      ],
      "whyTake": "Effective communication is essential for successful teaching. This program provides practical strategies to enhance your digital communication skills, improving collaboration and engagement in your classroom.",
      "fee": "₹14,000 per participant",
      "institutionalDiscount": "Yes, 15% discount for groups of 5 or more from the same institution",
      "image": "https://images.unsplash.com/photo-1506748686214-e9df14d4d9d0?auto=format&fit=crop&q=80&w=1740"
    },
    "digital-ethics": {
      "title": "Digital Ethics and Responsibility",
      "description": "Understanding the ethical implications of technology use in education and promoting responsible digital citizenship among students.",
      "duration": "2 days (16 hours)",
      "mode": ["In-person workshop", "Live virtual training"],
      "outcomes": [
        "Identify ethical issues related to technology use in education",
        "Implement best practices for responsible digital citizenship",
        "Create a culture of digital responsibility among students",
        "Evaluate and assess digital ethics effectiveness using data"
      ],
      "whyTake": "As technology becomes more integrated into education, understanding digital ethics is crucial. This program provides practical strategies to promote responsible technology use and digital citizenship among students.",
      "fee": "₹15,000 per participant",
      "institutionalDiscount": "Yes, 15% discount for groups of 5 or more from the same institution",
      "image": "https://images.unsplash.com/photo-1506748686214-e9df14d4d9d0?auto=format&fit=crop&q=80&w=1740"
    },
    "digital-leadership": {
      "title": "Digital Leadership in Education",
      "description": "Developing leadership skills to effectively integrate technology into educational institutions and drive innovation.",
      "duration": "3 days (24 hours)",
      "mode": ["In-person workshop", "Live virtual training"],
      "outcomes": [
        "Implement effective digital leadership strategies in educational settings",
        "Create a culture of innovation and collaboration among educators",
        "Evaluate and assess digital leadership effectiveness using data",
        "Design and implement technology integration plans for schools"
      ],
      "whyTake": "Digital leadership is essential for driving innovation in education. This program provides practical strategies to enhance your leadership skills, enabling you to effectively integrate technology into your institution.",
      "fee": "₹18,500 per participant",
      "institutionalDiscount": "Yes, 15% discount for groups of 5 or more from the same institution",
      "image": "https://images.unsplash.com/photo-1506748686214-e9df14d4d9d0?auto=format&fit=crop&q=80&w=1740"
    },
    
    "blended-learning": {
      "title": "Blended Learning Strategies",
      "description": "Effectively combining face-to-face and online learning for enhanced flexibility and engagement through various blended learning models.",
      "duration": "3 days (24 hours)",
      "mode": ["In-person workshop", "Live virtual training"],
      "outcomes": [
        "Implement different blended learning models appropriate for your context",
        "Design engaging online learning components and materials",
        "Select and integrate appropriate EdTech tools for blended environments",
        "Manage classroom workflows across online and offline activities",
        "Develop effective assessment strategies for blended learning"
      ],
      "whyTake": "Blended learning combines the best of face-to-face instruction with online learning opportunities, providing flexibility and personalization. This approach is increasingly essential in modern education and helps prepare students for future learning and work environments.",
      "fee": "₹17,500 per participant",
      "institutionalDiscount": "Yes, 15% discount for groups of 5 or more from the same institution",
      "image": "https://images.unsplash.com/photo-1610484826967-09c5720778c7?auto=format&fit=crop&q=80&w=1740"
    },
    "assessment-tools": {
      "title": "Assessment Tools and Techniques",
      "description": "Leveraging technology for more efficient, effective, and insightful assessment through digital tools and platforms.",
      "duration": "2 days (16 hours)",
      "mode": ["Live virtual training", "Self-paced online course with mentorship"],
      "outcomes": [
        "Use online platforms for efficient formative and summative assessment",
        "Create and manage effective digital student portfolios",
        "Implement digital rubrics and feedback tools to streamline evaluation",
        "Facilitate meaningful peer and self-assessment using technology",
        "Analyze assessment data to inform instructional decisions"
      ],
      "whyTake": "Digital assessment tools can save time, provide faster feedback to students, and generate valuable data to inform teaching. This program equips you with practical skills to transform your assessment practice using accessible technology.",
      "fee": "₹16,000 per participant",
      "institutionalDiscount": "Yes, 15% discount for groups of 6 or more from the same institution",
      "image": "https://images.unsplash.com/photo-1434030216411-0b793f4b4173?auto=format&fit=crop&q=80&w=1740"
    },
    "online-content": {
      "title": "Creating Engaging Online Content",
      "description": "Designing dynamic and interactive digital learning materials that capture student interest using multimedia and instructional design principles.",
      "duration": "3 days (24 hours)",
      "mode": ["Live virtual training", "Self-paced online course"],
      "outcomes": [
        "Create interactive presentations and digital lessons beyond static slides",
        "Produce simple instructional videos and screencasts for student engagement",
        "Integrate multimedia and interactive elements into digital learning materials",
        "Apply instructional design principles to online content creation",
        "Effectively locate and adapt Open Educational Resources for classroom use"
      ],
      "whyTake": "Engaging digital content can transform student learning experiences and increase motivation. This program provides practical skills to create materials that capture attention, facilitate understanding, and make learning more interactive.",
      "fee": "₹17,000 per participant",
      "institutionalDiscount": "Yes, 15% discount for groups of 5 or more from the same institution",
      "image": "https://images.unsplash.com/photo-1581291518633-83b4ebd1d83e?auto=format&fit=crop&q=80&w=1740"
    },
    "data-driven": {
      "title": "Data-Driven Instruction",
      "description": "Using student data collected through technology to inform teaching practices, improve differentiation, and track progress.",
      "duration": "2 days (16 hours)",
      "mode": ["In-person workshop", "Live virtual training"],
      "outcomes": [
        "Identify and utilize key data sources in digital learning environments",
        "Efficiently collect and organize student data using digital tools",
        "Analyze and visualize student data to identify patterns and trends",
        "Implement data-informed differentiation and grouping strategies",
        "Set and monitor learning goals based on data insights"
      ],
      "whyTake": "Data-driven instruction enables more targeted, effective teaching tailored to student needs. This program provides practical tools to collect, analyze, and act on student data without feeling overwhelmed, leading to improved outcomes and more personalized learning.",
      "fee": "₹16,500 per participant",
      "institutionalDiscount": "Yes, 15% discount for groups of 6 or more from the same institution",
      "image": "https://images.unsplash.com/photo-1551288049-bebda4e38f71?auto=format&fit=crop&q=80&w=1740"
    },
    "teacher-wellness": {
      "title": "Teacher Wellness and Stress Management",
      "description": "Helping teachers manage workload and well-being in a technology-rich environment through digital organization and mindfulness practices.",
      "duration": "1 day (8 hours)",
      "mode": ["In-person workshop", "Live virtual training", "Self-paced online course"],
      "outcomes": [
        "Implement effective strategies for managing digital communication overload",
        "Utilize digital tools for time management and task prioritization",
        "Leverage technology for automating repetitive teaching tasks",
        "Practice digital detox and mindfulness techniques for educator wellbeing",
        "Build supportive online professional learning networks"
      ],
      "whyTake": "Teacher burnout is a growing concern, especially with increased technology demands. This program provides practical strategies to manage digital workload, reduce stress, and maintain wellbeing while leveraging technology to work smarter, not harder.",
      "fee": "₹12,000 per participant",
      "institutionalDiscount": "Yes, 20% discount for groups of 8 or more from the same institution",
      "image": "https://images.unsplash.com/photo-1604480133435-25b86862d276?auto=format&fit=crop&q=80&w=1740"
    },
    "computational-thinking": {
      "title": "Coding and Computational Thinking",
      "description": "Introducing foundational concepts of coding and computational thinking applicable across subjects, aligning with NEP guidelines.",
      "duration": "3 days (24 hours)",
      "mode": ["In-person workshop", "Live virtual training"],
      "outcomes": [
        "Apply computational thinking concepts across different subject areas",
        "Facilitate simple coding activities using block-based programming platforms",
        "Implement 'unplugged' coding activities requiring minimal technology",
        "Integrate computational thinking across various curriculum subjects",
        "Introduce basic physical computing concepts using simple devices"
      ],
      "whyTake": "Computational thinking is becoming an essential skill for all students, not just those interested in computer science. This program helps you integrate these concepts across subjects, fostering problem-solving skills while aligning with NEP 2020 recommendations.",
      "fee": "₹18,000 per participant",
      "institutionalDiscount": "Yes, 15% discount for groups of 5 or more from the same institution",
      "image": "https://images.unsplash.com/photo-1515879218367-8466d910aaa4?auto=format&fit=crop&q=80&w=1740"
    },
    "gamification": {
      "title": "Gamification in Education",
      "description": "Using game elements and mechanics to increase student motivation, engagement, and participation in the classroom.",
      "duration": "2 days (16 hours)",
      "mode": ["In-person workshop", "Live virtual training"],
      "outcomes": [
        "Implement core game mechanics in educational contexts",
        "Design engaging gamified learning activities and unit structures",
        "Utilize digital platforms to manage gamification elements",
        "Effectively use points, badges, and leaderboards to motivate learning",
        "Create compelling narratives and challenges for classroom engagement"
      ],
      "whyTake": "Gamification can transform student motivation and engagement by tapping into natural human interests in challenge, achievement, and play. This program provides practical strategies to gamify learning without sacrificing academic rigor.",
      "fee": "₹15,500 per participant",
      "institutionalDiscount": "Yes, 15% discount for groups of 6 or more from the same institution",
      "image": "https://images.unsplash.com/photo-1511213966740-24d719a0a814?auto=format&fit=crop&q=80&w=1740"
    },
    "presentation-skills": {
      "title": "Presentation Skills for Educators",
      "description": "Equipping educators with techniques to deliver engaging, confident, and memorable presentations that capture audience attention.",
      "duration": "2 days (16 hours)",
      "mode": ["In-person workshop", "Live virtual training"],
      "outcomes": [
        "Structure presentations for maximum impact with strong openings and memorable conclusions",
        "Master vocal variety and body language techniques for confident delivery",
        "Design visually engaging presentation slides beyond standard bullet points",
        "Implement interactive techniques and storytelling to maintain audience engagement",
        "Confidently manage presentation anxiety and handle Q&A sessions effectively"
      ],
      "whyTake": "Effective presentation skills are essential for educators in classrooms, staff meetings, and professional development. This program provides practical techniques to transform your presentations from ordinary to compelling, helping you better engage students and colleagues.",
      "fee": "₹16,000 per participant",
      "institutionalDiscount": "Yes, 15% discount for groups of 5 or more from the same institution",
      "image": "https://images.unsplash.com/photo-1475721027785-f74eccf877e2?auto=format&fit=crop&q=80&w=1740"
    }
}